# StairsTopOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTopOffset Property
ParameterTypeId Class See Also
---
"Top Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTopOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTopOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTopOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace